Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/product_safety_and_labelling/safety_of_products_for_sale.html.txt.tmx
Source language: en
Languages: ga

source: Safety of Products for Sale
ga: Sábháilteacht i gcóir Táirgí ar Díol

source: To protect consumers’ health and safety, laws exist that ensure producers or importers of goods must only place safe products on the market in the European Union
ga: Chun sábháilteacht agus sláinte tomhaltóirí a chosaint, tá dlíthe ann le cinntiú go gcuireann táirgeoirí nó allmhaireoirí táirgí sábháilte amháin ar an margadh san Aontas Eorpach

source: no 199 of 2004 European Communities (General Product Safety) Regulations prohibits the placing of unsafe goods on the Irish market
ga: Uimh 199 de 2004 Rialúcháin na gComhphobal Eorpach (Sábháilteacht Ghinearálta Táirgí) cosc ar tháirgí contúirteacha a chur ar an margadh Éireannach

source: This means that any product made available to buy, must not present any undue risk to the consumer under its normal use
ga: Ciallaíonn sé seo nach féidir le haon táirge atá ar díol dochar féideartha a dhéanamh don tomhaltóir agus é á úsáid ar an ngnáthbhealach

source: In addition, certain categories of products are covered by sector specific legislation and product specific provisions
ga: Ina theannta sin, catagóirí áirithe táirgí atá clúdaithe ag reachtaíocht earnálacha sonracha agus le forálacha táirge ar leith

source: Specific safety rules exist for food products that are administered by the Food Safety Authority of Ireland
ga: Tá rialacha faoi leith i gcóir táirgí bia in Éirinn atá curtha i bhfeidhm ag Údarás Sábháilteachta Bia na hÉireann

source: Read more about food safety here
ga: Léigh tuilleadh faoi shábháilteacht bia anseo

source: The National Standards Authority of Ireland (NSAI) is Ireland’s national standards body
ga: Is é an tÚdarás Náisiúnta Caighdeáin na hÉireann (NSAI) an eagraíocht náisiúnta caighdeán in Éirinn

source: of specific products for sale in Ireland. Any product for sale here that has a standard, must reach the minimum requirements set out in that standard
ga: Is é an ról atá aige caighdeáin a chur chun cinn maidir le sábháilteacht, cáilíocht, dearadh agus feidhmiú (srl.) táirgí faoi leith atá ar díol in Éirinn

source: Products with safety standards might include items such as children’s cots or stair gates
ga: Ní mór d’aon táirge atá ar díol anseo agus a bhfuil caighdeán aige, na bunriachtanais atá curtha roimh an gcaighdeán sin, a bhaint amach

source: Standards are developed by the NSAI in consultation with producers and consumers
ga: I measc táirgí a d’fhéadfadh caighdeáin sábháilteachta a bheith acu, d’fhéadfaí cliabháin leanaí nó geataí staighre a bheith ann

source: The NSAI also examines best international practice with regard to product safety
ga: Forbraítear caighdeáin ag an NSAI i gcomhairle le táirgeoirí agus an pobal agus déantar scrúdú ar an dea-chleachtas idirnáisiúnta freisin

source: The NSAI develops these standards to protect consumers from buying dangerous or substandard goods
ga: Forbraíonn an NSAI na caighdeáin seo le tomhaltóirí a chosaint ionas nach gceannóidh siad táirgí contúirteacha nó táirgí atá faoi bhun an chaighdeáin

source: The European Union also aims to protect consumers from unsafe products manufactured outside the European Union
ga: Tá sé mar aidhm ag an Aontas Eorpach chomh maith chun tomhaltóirí a chosaint ó na táirgí a mhonaraítear neamhshábháilte lasmuigh den Aontas Eorpach

source: Sometimes, risks are associated with products arising from their normal use
ga: Uaireanta, baineann contúirtí le táirgí agus iad á n-úsáid ar an ngnáthbhealach

source: These risks are called ‘inherent risks’
ga: Tugtar ‘bunchontúirtí’ orthu seo

source: Candles, for example, can present inherent risks if care is not taken to use them properly
ga: Cuir i gcás, d’fhéadfadh bunchontúirtí a bheith ag coinnle mura n-úsáidtear i gceart iad agus go cúramach

source: They are, however, quite safe when used properly and with care
ga: Mar sin féin, tá siad réasúnta sábháilte ach iad a úsáid i gceart agus le cúram

source: In such cases, producers must warn consumers of any dangers associated with improper use of the product
ga: I gcásanna mar seo, ní mór do tháirgeoirí rabhadh a thabhairt do thomhaltóirí faoi na contúirtí a bhaineann le drochúsáid an táirge

source: Warnings such as ‘Never leave a naked flame unattended’ should appear on the packaging to highlight this danger
ga: Ba cheart go mbeadh rabhadh le feiceáil ar lipéadú an táirge cosúil le ‘Ná fág lasair nocht gan feighil’ chun an chontúirt seo a shoiléiriú

source: If you are harmed by a defective product, the producer, importer, and in certain circumstances, the supplier may be liable for the damage caused
ga: Má dhéantar dochar duit de bharr táirge lochtaigh, d’fhéadfadh an táirgeoir, an t-allmhaireoir, agus i gcoinníollacha áirithe, an soláthraí a bheith freagrach as an damáiste a dhéantar

source: In evaluating whether a product is defective, the main criteria used are the product’s presentation and the use to which it could reasonably be put
ga: Agus measúnú á dhéanamh ar lochtaíl táirge, is iad na príomhchritéir a úsáidtear ná cur i láthair an táirge agus an úsáid a d’fhéadfaí a bhaint as go réasúnta

source: A product is deemed defective only after taking into account the circumstances of its use
ga: Ní mheastar táirge a bheith lochtach ach amháin nuair atá na coinníollacha úsáide curtha san áireamh

source: This means that if a product is used improperly that it may not be deemed to be defective
ga: Má dhéanann tú neamhaird ar an rabhadh ar bhosca coinnle agus má fhágann tú iad ar lasadh i seomra gan feighil, ní bheidh aon chúiteamh agat má théann do sheomra trí thine

source: How do I know if a product is safe?
ga: Cén chaoi a bhfuil a fhios agam go bhfuil táirge sábháilte nó nach bhfuilω

source: The CE mark on a product signifies that the product conforms to all EU Directives and health, safety and environmental protection standards
ga: Má tá an táirge clúdaithe ag Treoir ó rannóg faoi leith a leanann caighdeáin chosanta sláinte agus timpeallachta ní mór dó marc CE a iompar

source: Any product that is covered by an EU Directive must carry a CE mark. The CE marking must be affixed, indelibly to the product
ga: Is lipéad le dronuilleog bhán é an marc CE ar tháirge ar a bhfuil na litreacha CE i litreacha dubha

source: However, where this is not possible on account of the nature of the product, it must be affixed to the packaging
ga: Is dearbhú é ón táirgeoir an marc CE go leanann an táirge reachtaíocht uilig an Aontais Eorpaigh a bhaineann leis

source: Read more about the CE mark
ga: Breathnaigh ar an marc CE

source: The Competition and Consumer Protection Commission (CCPC) is responsible for market surveillance to ensure compliance with the General Product Safety Directive
ga: Tá Oifig an Stiúrthóra Gnóthaí Tomhaltóirí freagrach as faire ar an margadh agus as comhlíonadh den Treoir Ghinearálta um Shábháilteacht Táirgí a chinntiú

source: If you would like to report a product that you feel is unsafe contact the CCPC
ga: Más maith leat tuairisc a dhéanamh ar tháirge a bhraitheann tú gan a bheith sábháilte téigh i dteagmháil le hOifig an Stiúrthóra Gnóthaí Tomhaltóirí

source: You can read more about specific product safety rules for certain categories of products – these include:
ga: Tá rialacha sábháilteachta táirgí sainiúla ag catagóirí táirgí áirithe – ina measc siúd tá:

source: • Toys, and other products made especially for children
ga: • Bréagáin, agus táirgí eile atá déanta go speisialta do leanaí

source: • Domestic gas and electrical items and furniture
ga: • Gléasanna leictreacha tí agus troscán

source: Producers are forbidden from placing dangerous products on the EU market
ga: Tá cosc ar tháirgeoirí táirgí contúirteacha a chur ar mhargadh an AE

source: If a product on the market is found to be dangerous, it is withdrawn or ‘recalled’
ga: Má aimsítear amach go bhfuil táirge contúirteach, baintear de na seilfeanna é nó ‘aisghairtear’ é

source: This occurs when items for sale or already sold to consumers are taken back by the manufacturer as they are found to be unsafe for consumers
ga: Tarlaíonn sé seo nuair a thógann táirgeoirí ar ais míreanna atá ar díol nó míreanna atá díolta do thomhaltóirí cheana féin, mar gheall go bhfuil siad ceaptha a bheith contúirteach

source: Consumers who have purchased unsafe items are entitled to a refund or a replacement
ga: Tá tomhaltóirí i dteideal aisíocaíochta nó athsholáthair má cheannaíonn siad míreanna mí-shábháilte

source: If possible, the company will contact you and other consumers of the dangerous product directly
ga: Más indéanta é, rachaidh an comhlacht i dteagmháil leatsa nó le tomhaltóirí eile go díreach faoin táirge contúirteach

source: Alternatively it will place advertisements in the national media or press to highlight the recall
ga: De rogha air sin, cuirfidh an comhlacht fógraí sna meáin náisiúnta nó sa phreas chun aird a tharraingt ar aisghairm an táirge

source: The Competition and Consumer Protection Commission maintains details of recalled products on its website
ga: Coinníonn an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí sonraí na táirgí cuimhne ar a láithreán gréasáin

source: The European Commission gives guidance to manufacturers on how to organise a product recall
ga: Tugann an Coimisiún Eorpach treoir do dhéantúsóirí ar an gcaoi le haisghairm táirge a bhaint amach

source: Details of all products that have been recalled in the EU are displayed on the RAPEX website
ga: Tá sonraí de na táirgí go léir a d’aisghairm an tAE le feiceáil ar láithreán Gréasáin RAPEX

source: RAPEX, stands for the Rapid Alert System for Non Food Products
ga: Is éard is RAPEX ann an Córas Mear-Fholáirimh do Tháirgí (seachas Táirgí Bia)

source: This rapid alert system covers all products likely to be use by consumers except for food and medicines (which have similar but separate systems)
ga: Clúdaíonn an córas mear-fholáirimh seo na táirgí go léir (nach bia nó cógas leighis é, a bhfuil córais acu seo atá cosúil leis seo) a d’fhéadfadh tomhaltóirí a úsáid

source: This system ensures rapid communication between Member States if an item is found to be unsafe
ga: Cinntíonn an córas seo mearchumarsáid idir na ballstáit mura bhfuil an mhír sábháilte

source: Dangerous Foodstuffs are usually recalled through the national food authorities
ga: Aisghaireadh bia-ábhair chontúirteacha tríd na heagraíochtaí bia náisiúnta

source: (In Ireland, this is the Food Safety Authority)
ga: (In Éirinn, an tÚdarás um Shábháilteacht Bia)

source: Dangerous medicines in Ireland are usually recalled through the Health Products Regulatory Authority and the Department of Health
ga: Aisghairtear cógas leighis chontúirteach trí an tÚdarás Rialála Táirgí Sláinte agus an Roinn Sláinte

source: If you have concerns about the safety of any product you can contact the Competition and Consumer Protection Commission (CCPC)
ga: Má tá tú buartha faoi shábháilteacht táirge ar bith, is féidir leat teagmháil a dhéanamh leis an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí (CCPC)

source: The CCPC carries out market surveillance to ensure compliance with product safety laws
ga: Déanann an CCPC faire ar an margadh le cinntiú go leantar na rialacha maidir le sábháilteacht táirgí

source: It has the power to order the removal of unsafe products from the market and to prosecute producers or importers of unsafe products
ga: Tá an chumhacht ag an CCPC na táirgí mí-shábháilte a bhaint den mhargadh agus an dlí a chur ar tháirgeoirí nó allmhaireoirí na dtáirgí mí-shábháilte

source: You can find more information on product safety on the CCPC website and on the European Commission website
ga: Is féidir leat tuilleadh eolais a fháil ar shábháilteacht an táirge ar an láithreán gréasáin CCPC agus ar shuíomh gréasáin an Choimisiúin Eorpaigh
